
class Program
{
    static void Main()
    {
        #region Виды

        // Архитектура приложения описывает шаблоны и методы, используемые для проектирования и создания приложения.
        // Архитектура рисует для нас карту, с помощью которой наше приложение приобретает четкую структуру.

        /*многоуровневая архитектура;
          микросервисы;
          архитектура, управляемая событиями;
          архитектура, ориентированная на службы.*/

        #endregion

        #region МНОГОУРОВНЕВАЯ АРХИТЕКТУРА

        // Многоуровневая архитектура — это традиционная архитектура, которая часто используется для создания локальных и корпоративных приложений.

        #endregion


        #region МИКРОСЕРВИСЫ

        // Микросервисы — это одновременно и архитектура, и подход к написанию программного обеспечения.
        // С помощью микросервисов приложение разбивается на мельчайшие компоненты, независимые друг от друга.
        // Каждый из этих компонентов или процессов представляет собой микросервис.

        #endregion


        #region АРХИТЕКТУРА, УПРАВЛЯЕМАЯ СОБЫТИЯМИ (EVENT-DRIVEN ARCHITECTURE, EDA)

        // В системе, управляемой событиями, основной структурой решения являются захват, передача, обработка и сохранение событий.
        // Это отличается от традиционной модели, основанной на запросах.

        // Под событием здесь понимается любое существенное событие или изменение состояния аппаратного или программного обеспечения системы.
        // Источником события может быть внутренний или внешний вход.

        #endregion


        #region СЕРВИС-ОРИЕНТИРОВАННАЯ АРХИТЕКТУРА (SERVICE-ORIENTED ARCHITECTURE, SOA)

        // Сервис-ориентированная архитектура (SOA) — это устоявшийся стиль проектирования программного обеспечения, который похож на стиль архитектуры микросервисов.
        // SOA структурирует приложения в дискретные повторно используемые сервисы, которые обмениваются данными через служебную шину предприятия (ESB).

        #endregion
    }
}